/****************************************************************************
* 文 件 名: IRRecod.h
* 作    者: 创思通信
* 修    订: 2015-06-08
* 版    本: V1.0
* 描    述: 红外发送头文件
****************************************************************************/
#ifndef __IRSEND_H
#define __IRSEND_H

#include "hal_types.h"
#include <ioCC2530.h>

/**********************************CONSTANTS***********************************/

/******************************LOCAL FUNCTIONS*********************************/
void IRSendInit(void);
uint8 IR_Sending(uint16 IRDat);
#endif


















