
/****************************************************************************
* 文 件 名: IRDecod.h
* 作    者: 创思通信
* 修    订: 2015-06-08
* 版    本: V1.0
* 描    述: 红外解码头文件
****************************************************************************/
#ifndef __IRRECOD_H
#define __IRRECOD_H

#include "hal_types.h"
#include <ioCC2530.h>

/**********************************CONSTANTS***********************************/
//定义控制IR的端口
#define IR_IRQ P0_5	//IR为P0.5口控制		
/******************************LOCAL FUNCTIONS*********************************/
void IRInit(void);
uint8 IR_Decoding(void);
#endif


















